export default {
    releaseNotes: [
        {
            ver: "v1.3.2h8",
            time: "2023/07/14",
            notes: [
                "iOS App 导出游玩回放文件时显示二维码,方便在无法复制到剪贴板时下载文件",
                "登录页面支持回车登录",
                "将`更新日志`按钮移到主界面下方",
                "优化全屏判定逻辑",
                "修改血量条样式",
                "修复若干 bugs",
            ]
        },
        {
            ver: "v1.3.2h7",
            time: "2023/07/10",
            notes: [
                "优化 PT社区谱面 加载,减轻服务器负担"
            ]
        },
        {
            ver: "v1.3.2h6",
            time: "2023/07/10",
            notes: [
                "本地曲目结算页面显示 PhiZone 用户信息",
                "优化离线游玩体验"
            ]
        },
        {
            ver: "v1.3.2h5",
            time: "2023/07/09",
            notes: [
                "修复bugs"
            ]
        },
        {
            ver: "v1.3.2h4",
            time: "2023/07/09",
            notes: [
                "优化在线资源包使用",
                "增加谱面特定资源包"
            ]
        },
        {
            ver: "v1.3.2h3",
            time: "2023/07/09",
            notes: [
                "新增转板模式：在单人游戏中,双击左下角可以进行转板操作",
                "上线更新日志",
                "取消选谱界面点击“选择”按钮时的二次确认",
                "新增全屏判定(实验性功能,可能会在后续版本中下架)"
            ]
        },
        {
            ver: "v1.3.2h2",
            time: "2023/07/08",
            notes: [
                "修复与PT社区谱面相关的bug",
                "优化PT社区谱面加载速度"
            ]
        },
        {
            ver: "v1.3.2h1",
            time: "2023/07/08",
            notes: [
                "修复导出游玩记录相关bug"
            ]
        },
        {
            ver: "v1.3.2",
            time: "2023/07/07",
            notes: [
                "重大更新：添加了额外选项-PT社区谱面 所有谱面均有授权！ 加载不出来的请清除缓存再此尝试！",
                "预计8日-10日发布比赛PV"
            ]
        },
        {
            ver: "v1.3.2h2",
            time: "2023/07/04",
            notes: [
                "修复了在线资源包功能",
                "iOS App增加生成游玩回放下载链接功能",
                "修复iOS App无法下載回放文件的问题",
                "移除了him",
                "修复了无法游戏全屏的问题"
            ]
        },
        {
            ver: "v1.3.0",
            time: "2023/06/24",
            notes: [
                "新增游玩回放功能，可以导出单人游玩回放，并可以导出房间内成员的游玩回放。",
                "支持使用资源包内打击音效。(感謝@星鹿ELEC)",
                "避免加载与上次相同谱面时重复加载的问题。",
                "变速成绩不再上传 PhiZone。",
                "微调Flick判定。",
                "修复部分显示问题。",
                "修复其他已知bug。"
            ]
        },
        {
            ver: "v1.2.2",
            time: "2023/05/15",
            notes: [
                "PhiZone B20查询",
                "单曲游玩记录排名查看（快速定位到自己的游玩记录和排除重复重复分数的排名暂未开发）",
                "上传分数不再经过PT服务器中转，直接由浏览器上传至PhiZone。"
            ]
        },
        {
            ver: "v1.2.1",
            time: "2023/05/03",
            notes: [
                "支持iOS设备游玩自定义谱面和使用自定义资源包",
                "在联机过程中出现本地谱面库没有的谱面会提示上传，现传现玩",
                "支持编辑本地谱面基本信息",
                "支持使用图片判定线等额外资源的谱面导入",
            ]
        },
        {
            ver: "v1.2.0",
            time: "2023/05/02",
            notes: [
                "添加本地谱面库功能，允许导入谱面文件到库并联机",
                "本地谱面支持搜索和分页",
                "增加一个新的 PhiTogether 预设资源包",
                "添加自定义资源包功能，并支持保存该资源包，在启动时自动应用",
                "浏览谱面列表时可直接跳转到对应页码",
                "支持Fiter 滤镜功能",
                "修复了iOS 16.4+ 无法正常游玩谱面的问题",
                "修复了游戏画面错位问题",
                "修改部分文字",
                "移除了“皮在一起模拟器”隐藏入口",
                "移除了him",
            ]
        },
        {
            ver: "v1.1.0",
            time: "2023/03/18",
            notes: [
                "增加了加载页面中的Tips",
                "添加了关于页面中的运行正计时",
                "UI 调整",
                "主页（未登录显示样式调整）",
                "关于页面（几项小修改）",
                "其它小样式修复",
                "修复了一些小 Bug",
                "优化 Safari 触控",
            ]
        }
    ]
}